# FilteredElementCollector Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredElementCollector Properties
FilteredElementCollector Class See Also
---
The FilteredElementCollector type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilteredElementCollector Class
Autodesk.Revit.DB Namespace